/* eslint-disable quote-props */
/* eslint-disable quotes */

export const ERRORS = {
  'authorize': {
    'wrong_credentials': 'Указан неверный логин или пароль',
    'session_expired': 'Текущая сессия не найдена. Возможно, она была закрыта из-за неактивности пользователя.',
    'blocked': 'Ваша учётная запись заблокирована. Для разблокировки доступа необходимо обратиться в отделение Райффайзенбанка и написать заявление на разблокировку учётной записи.В течение одного рабочего дня запись будет разблокирована.',
    'no_organizations': 'Пользователь не подключен ни к одной организации. Обратитесь к администратору',
    'contract_canceled': 'Доступ ограничен по причине расторжения контракта. Пожалуйста, обратитесь за разъяснениями в обслуживающий Вас офис Райффайзенбанка.',
    'no_services': 'Нет подключенных услуг. Подключить услугу Вы можете в отделении Райффайзенбанка.',
    'confirmation': 'Для продолжения работы необходимо ввести пароль.',
    'wrong_device_id': 'Неверно указан уникальный идентификатор устройства.',
    'wrong_app_id': 'Неверно указан уникальный идентификатор приложения.',
    'wrong_os_version': 'Неверно указана версия ОС.',
    'wrong_app_version': 'Неверно указана версия приложения.',
    'not_allowed': 'У вас нет права доступа к данной системе. Для получения доступа или дополнительной информации обратитесь в службу технической поддержки.'
  }
}
